SELECT * FROM healthy_life.product_category;
TRUNCATE Table product_category;
INSERT INTO product_category (p_category_id, p_category_name) VALUES
(1, '닭가슴살·육류'),
(2, '도시락'),
(3, '간식'),
(4, '음료'),
(5, '샐러드'),
(6, '비건'),
(7, '저당'),
(8, '해산물'),
(9, '견과류');


INSERT INTO product_category_details
(p_category_details_id, p_category_id, p_category_details_name)
VALUES
-- 닭가슴살·육류
(1, 1, '닭가슴살'),
(2, 1, '달걀'),
(3, 1, '소고기'),

-- 도시락
(4, 2, '볶음밥'),
(5, 2, '주먹밥'),
(6, 2, '즉석밥'),

-- 간식
(7, 3, '에너지바'),
(8, 3, '과자'),
(9, 3, '베이커리'),

-- 음료
(10, 4, '물'),
(11, 4, '탄산수'),
(12, 4, '프로틴음료'),
(13, 4, '커피'),
(14, 4, '차'),
(15, 4, '제로음료'),

-- 샐러드
(16, 5, '닭가슴살샐러드'),
(17, 5, '연어샐러드'),
(18, 5, '구운스테이크샐러드'),

-- 비건
(19, 6, '간식'),
(20, 6, '간편식'),
(21, 6, '식재료'),

-- 저당
(22, 7, '저당간식'),
(23, 7, '저당음료'),
(24, 7, '저당드레싱'),

-- 해산물
(25, 8, '생선'),
(26, 8, '해조류'),
(27, 8, '어패류'),

-- 견과류
(28, 9, '견과류');
